{
  "personalInfo": {
    "name": "João Vitor",
    "lastName": "Moitinho",
    "title": {
      "en": "Tech Lead & Full‑stack Developer",
      "pt": "Tech Lead & Desenvolvedor Full‑stack"
    },
    "description": {
      "en": "Full‑stack developer with a degree in Computer Engineering and a background spanning web development, system architecture, and design. I build end‑to‑end solutions from technical planning to production deployment with a focus on performance, clarity, and maintainability.",
      "pt": "Desenvolvedor full‑stack com formação em Engenharia da Computação e experiência em desenvolvimento web, arquitetura de sistemas e design. Construo soluções de ponta a ponta, do planejamento técnico ao deploy em produção, com foco em performance, clareza e manutenibilidade."
    },
    "email": "contato@moitinho.dev",
    "location": "Curitiba, Paraná, Brazil",
    "availableForWork": true,
    "currentRole": {
      "en": "Tech Lead",
      "pt": "Tech Lead"
    },
    "currentCompany": "NineTwo Performance",
    "currentPeriod": "Jan 2026 — Present",
    "photoUrl": "/profile-photo.jpg"
  },
  "skills": [
    "React",
    "Next.js",
    "TypeScript",
    "Node.js",
    "Vue.js",
    "Java",
    "Azure",
    "Docker",
    "PostgreSQL",
    "MongoDB",
    "GraphQL",
    "Prisma",
    "Tailwind CSS",
    "Figma"
  ],
  "socials": [
    {
      "name": "GitHub",
      "handle": "@eumoitinho",
      "url": "https://github.com/eumoitinho"
    },
    {
      "name": "LinkedIn",
      "handle": "joaovitormoitinho",
      "url": "https://www.linkedin.com/in/eumoitinho"
    },
    {
      "name": "Behance",
      "handle": "eumoitinho",
      "url": "https://www.behance.net/joaomoitinh1"
    }
  ],
  "experiences": [
    {
      "id": "1",
      "year": "Jan 2026 — Present",
      "role": {
        "en": "Tech Lead",
        "pt": "Tech Lead"
      },
      "company": "NineTwo Performance",
      "location": "Curitiba, Brasil",
      "description": {
        "en": "Own the end-to-end technical strategy for a performance marketing agency from architecture design to production deployment. Build and ship full-stack applications using Next.js, Vue.js, Nest, Java, TypeScript, Prisma and Azure.\nDeveloping in-house martech products including a multi-tenant analytics platform (Google Ads, GA4, Meta Ads integrations) and a proprietary user tracking SDK published to npm.\nLead the dev team through code reviews, PR approvals and hands-on mentorship, having established the company's entire engineering ecosystem from scratch.",
        "pt": "Responsável pela estratégia técnica de ponta a ponta de uma agência de marketing de performance, do design de arquitetura ao deploy em produção. Construo e entrego aplicações full-stack usando Next.js, Vue.js, Nest, Java, TypeScript, Prisma e Azure.\nDesenvolvendo produtos martech internos incluindo plataforma analytics multi-tenant (Google Ads, GA4, Meta Ads) e um SDK proprietário de rastreamento de usuários publicado no npm.\nLidero o time de dev com code reviews, aprovações de PR e mentoria hands-on, tendo estabelecido todo o ecossistema de engenharia da empresa do zero."
      },
      "tech": [
        "Next.js",
        "Vue.js",
        "TypeScript",
        "Java",
        "Prisma",
        "Azure"
      ]
    },
    {
      "id": "2",
      "year": "May 2025 — Jan 2026",
      "role": {
        "en": "Full-stack Developer",
        "pt": "Desenvolvedor Full-stack"
      },
      "company": "NineTwo Performance",
      "location": "Curitiba, Brasil",
      "description": {
        "en": "Complete stack migration from WordPress to Next.js/TypeScript. Built the development infrastructure from scratch (GitHub org, Vercel, CI/CD, Azure).\n29+ projects delivered: SaaS platforms, institutional websites and landing pages.",
        "pt": "Migração completa do stack de WordPress para Next.js/TypeScript. Construí a infraestrutura de desenvolvimento do zero (GitHub org, Vercel, CI/CD, Azure).\n29+ projetos entregues: plataformas SaaS, sites institucionais e landing pages."
      },
      "tech": [
        "Next.js",
        "TypeScript",
        "Vercel",
        "Azure",
        "CI/CD"
      ]
    },
    {
      "id": "3",
      "year": "Feb 2025 — May 2025",
      "role": {
        "en": "Web Designer",
        "pt": "Web Designer"
      },
      "company": "NineTwo Performance",
      "location": "Curitiba, Brasil",
      "description": {
        "en": "Interface design, social media and WordPress website development for agency clients.",
        "pt": "Design de interfaces, mídias sociais e desenvolvimento de sites WordPress para clientes da agência."
      },
      "tech": [
        "Figma",
        "WordPress",
        "UI/UX"
      ]
    },
    {
      "id": "4",
      "year": "Nov 2021 — Present",
      "role": {
        "en": "Graphic Designer",
        "pt": "Designer Gráfico"
      },
      "company": "MSync Creative Studio",
      "location": "Dourados, Brasil",
      "description": {
        "en": "Run a small creative studio focused on visual design for digital media, print, motion graphics, and artist portfolios. Worked with 50+ clients across different industries.\nDesigned press kits and EPKs for artists such as Welker (2024), Berg (2023), and Silver Panda (2023).\nCreated visual strategies that helped clients increase social media engagement by 40%.",
        "pt": "Gerencio um estúdio criativo focado em design visual para mídia digital, impressão, motion graphics e portfólios de artistas. Trabalhei com 50+ clientes de diferentes setores.\nDesenhei press kits e EPKs para artistas como Welker (2024), Berg (2023) e Silver Panda (2023).\nCriei estratégias visuais que ajudaram clientes a aumentar engajamento em 40%."
      },
      "tech": [
        "Adobe Suite",
        "Figma",
        "Motion Graphics"
      ]
    },
    {
      "id": "5",
      "year": "Aug 2022 — Jan 2025",
      "role": {
        "en": "Webmaster",
        "pt": "Webmaster"
      },
      "company": "Donatti Turismo",
      "location": "Campo Grande, Brasil",
      "description": {
        "en": "Created digital content and improved the company's online presence with a focus on conversion and engagement.\nBuilt a landing page with Google Sheets API automation, streamlining the content workflow.\nManaged integrated campaigns through Meta Business, coordinating Instagram, WhatsApp, Google Business, and Facebook.",
        "pt": "Criei conteúdo digital e melhorei a presença online da empresa com foco em conversão e engajamento.\nConstruí uma landing page com automação Google Sheets API, otimizando o fluxo de conteúdo.\nGerenciei campanhas integradas via Meta Business, coordenando Instagram, WhatsApp, Google Business e Facebook."
      },
      "tech": [
        "HTML",
        "CSS",
        "Meta Business",
        "Google Sheets API"
      ]
    },
    {
      "id": "6",
      "year": "Mar 2024 — Jul 2024",
      "role": {
        "en": "Graphic Designer (Contract)",
        "pt": "Designer Gráfico (Contrato)"
      },
      "company": "Inspirare Mídia",
      "location": "Dourados, Brasil",
      "description": {
        "en": "Created visual content for social media and digital marketing campaigns.\nDesigned digital assets that supported organic audience growth and engagement.\nDeveloped offline visuals for the World BT Rio Brilhante 2024 event.",
        "pt": "Criei conteúdo visual para mídias sociais e campanhas de marketing digital.\nDesenhei assets digitais que apoiaram crescimento orgânico e engajamento.\nDesenvolvi materiais offline para o evento World BT Rio Brilhante 2024."
      },
      "tech": [
        "Adobe Suite",
        "Print"
      ]
    },
    {
      "id": "7",
      "year": "Feb 2022 — Nov 2022",
      "role": {
        "en": "Clinical Engineering Intern",
        "pt": "Estagiário de Engenharia Clínica"
      },
      "company": "CERDIL",
      "location": "Dourados, Brasil",
      "description": {
        "en": "Provided technical support for the maintenance of critical medical equipment, ensuring continuous operation of hospital systems.\nAssisted in the maintenance of MRI, CT, and X-ray systems.\nGained hands-on experience with PACS solutions from Philips, Siemens, and GE.",
        "pt": "Suporte técnico para manutenção de equipamentos médicos críticos, garantindo operação contínua dos sistemas hospitalares.\nAuxiliei na manutenção de sistemas de RM, TC e raio-X.\nExperiência prática com soluções PACS da Philips, Siemens e GE."
      },
      "tech": [
        "PACS",
        "Medical Devices"
      ]
    },
    {
      "id": "8",
      "year": "Sep 2019 — Jul 2022",
      "role": {
        "en": "Marketing Lead",
        "pt": "Líder de Marketing"
      },
      "company": "Include ME (Junior Enterprise, UFGD)",
      "location": "Dourados, Brasil",
      "description": {
        "en": "Led the marketing and design areas of the junior enterprise, focusing on brand development and client acquisition.\nCreated visual identities and outreach strategies that supported new client partnerships.\nImplemented Google Workspace for the entire team, improving cloud collaboration.\nIntroduced agile methodologies (Kanban and Scrum) to speed up project delivery.",
        "pt": "Liderei as áreas de marketing e design da empresa júnior, focando em desenvolvimento de marca e aquisição de clientes.\nCriei identidades visuais e estratégias de captação para novas parcerias.\nImplementei Google Workspace para todo o time, melhorando colaboração na nuvem.\nIntroduzi metodologias ágeis (Kanban e Scrum) para acelerar entregas."
      },
      "tech": [
        "Figma",
        "Google Workspace",
        "Agile"
      ]
    },
    {
      "id": "9",
      "year": "Jul 2018 — Dec 2018",
      "role": {
        "en": "IT Support Intern",
        "pt": "Estagiário de Suporte TI"
      },
      "company": "Federal University of Grande Dourados (UFGD)",
      "location": "Dourados, Brasil",
      "description": {
        "en": "Provided technical support for university systems and IT infrastructure.\nResolved technical issues, helping reduce support ticket volume.\nManaged user accounts through Active Directory for over 9,000 users.\nPerformed preventive maintenance on IT equipment.",
        "pt": "Suporte técnico para sistemas universitários e infraestrutura de TI.\nResolvi problemas técnicos, ajudando a reduzir volume de tickets.\nGerenciei contas de usuários via Active Directory para mais de 9.000 usuários.\nRealizei manutenção preventiva em equipamentos de TI."
      },
      "tech": [
        "Active Directory",
        "IT Support"
      ]
    }
  ],
  "education": [
    {
      "id": "1",
      "year": "2018 — 2025",
      "institution": "UFGD - Federal University of Grande Dourados",
      "course": {
        "en": "Bachelor in Computer Engineering",
        "pt": "Bacharelado em Engenharia de Computação"
      }
    },
    {
      "id": "2",
      "year": "2015 — 2017",
      "institution": "ETEC - Escola Técnica Estadual de São Paulo",
      "course": {
        "en": "Technical Degree in IT",
        "pt": "Técnico em Informática"
      }
    }
  ],
  "certifications": [
    {
      "id": "1",
      "name": "Ignite ReactJS",
      "issuer": "Rocketseat",
      "year": "2023"
    },
    {
      "id": "2",
      "name": "Ignite Node.js",
      "issuer": "Rocketseat",
      "year": "2023"
    },
    {
      "id": "3",
      "name": "EF SET English Certificate (B2 Upper Intermediate)",
      "issuer": "EF Education First",
      "year": "2024"
    },
    {
      "id": "4",
      "name": "UI Design - Web & Mobile Applications",
      "issuer": "Origamid",
      "year": "2023"
    }
  ],
  "projects": [
    {
      "id": "26",
      "title": { "en": "Pesados Web", "pt": "Pesados Web" },
      "image": "/screenshots/21_pesados-web-4.png",
      "gifImage": "/screenshots/pesados_scroll.gif",
      "url": "https://pesadosweb.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Classifieds Platform",
      "featured": true,
      "highlight": {
        "en": "Brazil's largest truck classifieds since 2021 — co-founded with MMA legend Wanderlei Silva",
        "pt": "Maior classificados de caminhões do Brasil desde 2021 — co-fundado com Wanderlei Silva"
      },
      "description": {
        "en": "Brazil's largest truck classifieds platform since 2021. Rebuilt from scratch with Next.js 14 (App Router), PostgreSQL + Drizzle ORM, Asaas checkout (PIX/boleto/card), geolocation search, protected contacts, seller dashboard and admin panel. Co-founded with Wanderlei Silva.",
        "pt": "Maior classificados de caminhões do Brasil desde 2021. Reconstruído do zero com Next.js 14 (App Router), PostgreSQL + Drizzle ORM, checkout Asaas (PIX/boleto/cartão), busca por geolocalização, contato protegido, dashboard do vendedor e painel admin. Co-fundado com Wanderlei Silva."
      },
      "skills": ["Next.js 14", "TypeScript", "PostgreSQL", "Drizzle ORM", "Asaas", "Sanity CMS", "Azure"]
    },
    {
      "id": "23",
      "title": { "en": "RWTV", "pt": "RWTV" },
      "image": "/screenshots/18_rede_web_tv.png",
      "gifImage": "/screenshots/rwtv_scroll.gif",
      "url": "https://rwtv.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "News Platform",
      "featured": true,
      "highlight": {
        "en": "Full news platform with Sanity CMS — location-based articles and regional ad system",
        "pt": "Plataforma de notícias completa com Sanity CMS — artigos por localização e sistema de ads regional"
      },
      "description": {
        "en": "Full-featured news platform built with Next.js and fully integrated with Sanity CMS. Location-based news delivery shows articles relevant to the user's region. Custom regional advertising system allowing targeted ad placements by geographic area. Covers politics, economy, sports, culture, health and agriculture with real-time content management.",
        "pt": "Plataforma de notícias completa construída com Next.js e totalmente integrada com Sanity CMS. Entrega de notícias baseada em localização mostra artigos relevantes para a região do usuário. Sistema de publicidade regional personalizado permitindo anúncios direcionados por área geográfica. Cobre política, economia, esportes, cultura, saúde e agricultura com gestão de conteúdo em tempo real."
      },
      "skills": ["Next.js", "Sanity CMS", "TypeScript", "Geolocation", "Ad System"]
    },
    {
      "id": "29",
      "title": { "en": "Live Academia", "pt": "Live Academia" },
      "image": "/screenshots/24_liveacademia.png",
      "gifImage": "/screenshots/live_scroll.gif",
      "url": "https://liveacademia.m2z.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Fitness / Headless CMS",
      "featured": true,
      "highlight": {
        "en": "Gym chain platform with Sanity CMS — per-unit plan filtering and integrated checkout",
        "pt": "Plataforma de rede de academias com Sanity CMS — filtro de planos por unidade e checkout integrado"
      },
      "description": {
        "en": "The largest gym chain in Manaus. Built with Sanity CMS integration to filter and manage gym plans per unit — data comes from their internal system, is editable in Sanity, and displays with live preview. Features integrated checkout directly on the site. Content editors manage plans, pricing and unit-specific offerings without touching code.",
        "pt": "A maior rede de academias de Manaus. Construído com integração Sanity CMS para filtrar e gerenciar planos por unidade — dados vêm do sistema interno, são editáveis no Sanity e exibidos com preview ao vivo. Checkout integrado diretamente no site. Editores de conteúdo gerenciam planos, preços e ofertas por unidade sem tocar no código."
      },
      "skills": ["Next.js", "Sanity CMS", "TypeScript", "Checkout", "Headless"]
    },
    {
      "id": "33",
      "title": { "en": "NineTwo Insights", "pt": "NineTwo Insights" },
      "image": "/screenshots/28_frontend_1.png",
      "gifImage": "/screenshots/ninetwo_scroll.gif",
      "url": "https://insights.ninetwo.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Multi-tenant SaaS",
      "featured": true,
      "highlight": {
        "en": "Multi-tenant analytics platform — Google Ads, Meta Ads & GA4 in one place",
        "pt": "Plataforma analytics multi-tenant — Google Ads, Meta Ads & GA4 em um só lugar"
      },
      "description": {
        "en": "Multi-tenant marketing analytics platform built from scratch. Each agency creates client workspaces with isolated dashboards. Integrates Google Ads, Meta Ads, and GA4 data sources with real-time sync. Custom proprietary user tracking SDK published to npm. Role-based access control, data source management, and campaign performance analysis across channels.",
        "pt": "Plataforma de analytics de marketing multi-tenant construída do zero. Cada agência cria workspaces de clientes com dashboards isolados. Integra fontes de dados Google Ads, Meta Ads e GA4 com sincronização em tempo real. SDK proprietário de rastreamento publicado no npm. Controle de acesso por papel, gestão de fontes de dados e análise de performance de campanhas cross-channel."
      },
      "skills": ["Next.js", "TypeScript", "Prisma", "Azure", "Google Ads API", "Meta API", "GA4"]
    },
    {
      "id": "20",
      "title": { "en": "Roberto Navarro | Transforme sua Mentalidade", "pt": "Roberto Navarro | Transforme sua Mentalidade" },
      "image": "/screenshots/15_robertonavarro.png",
      "gifImage": "/screenshots/navarro_scroll.gif",
      "url": "https://robertonavarrooficial.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Financial Coaching / Education",
      "featured": true,
      "description": {
        "en": "Institutional platform for Roberto Navarro's Financial Coaching Institute (ICF), built with Payload CMS for full content autonomy. Integrated e-commerce for books, online courses and mentoring programs with secure checkout. Over 300,000 lives transformed through exclusive mindset methods.",
        "pt": "Plataforma institucional do Instituto de Coaching Financeiro (ICF) de Roberto Navarro, construída com Payload CMS para autonomia total de conteúdo. E-commerce integrado para livros, cursos online e programas de mentoria com checkout seguro. Mais de 300.000 vidas transformadas através de métodos exclusivos de mentalidade."
      },
      "skills": ["Next.js", "Payload CMS", "E-commerce", "TypeScript", "Tailwind CSS"],
      "highlight": {
        "en": "Headless CMS with integrated sales funnel for books, courses and mentoring",
        "pt": "CMS headless com funil de vendas integrado para livros, cursos e mentoria"
      }
    },
    {
      "id": "goup",
      "title": {
        "en": "G.O UP Company",
        "pt": "G.O UP Company"
      },
      "image": "/screenshots/30_goup.png.png",
      "url": "https://preview.goupcompany.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Marketing / Tech",
      "featured": false,
      "description": {
        "en": "Marketing agency specialized in traffic, landing pages, and results. Next.js project with blog, landing page, and SPA features.",
        "pt": "Agência de marketing especializada em tráfego, landing pages, resultados. Projeto em Next.js com blog, landing page e SPA."
      },
      "skills": [
        "Next.js",
        "SPA",
        "React"
      ]
    },
    {
      "id": "1",
      "title": {
        "en": "EPK - WELKER 2024",
        "pt": "EPK - WELKER 2024"
      },
      "image": "https://mir-s3-cdn-cf.behance.net/projects/max_808/2896a8209254549.Y3JvcCw2OTYsNTQ0LDYwLDI0.png",
      "url": "https://www.behance.net/gallery/209254549/PRESSKIT-WELKER-2024",
      "category": "PRESS KIT",
      "type": "Design & Photography",
      "featured": false,
      "description": {
        "en": "Comprehensive press kit for artist Welker — includes biography, high‑res photography, press images and tour assets used for media outreach and promotional campaigns.",
        "pt": "Comprehensive press kit for artist Welker — includes biography, high‑res photography, press images and tour assets used for media outreach and promotional campaigns."
      },
      "skills": [
        "Photography",
        "Graphic Design",
        "Branding"
      ]
    },
    {
      "id": "2",
      "title": {
        "en": "Mundial de Beach Tennis - World BT Rio Brilhante ITF®",
        "pt": "Mundial de Beach Tennis - World BT Rio Brilhante ITF®"
      },
      "image": "https://mir-s3-cdn-cf.behance.net/projects/max_808/473506221045579.Y3JvcCwxMjAwLDkzOCwwLDI5.jpg",
      "url": "https://www.behance.net/gallery/221045579/Mundial-de-Beach-Tennis-World-BT-Rio-Brilhante-ITF",
      "category": "EVENT BRANDING",
      "type": "Print & Digital",
      "featured": true,
      "highlight": {
        "en": "Complete visual identity for an ITF-sanctioned international beach tennis championship",
        "pt": "Identidade visual completa para campeonato internacional de beach tennis sancionado pela ITF"
      },
      "description": {
        "en": "Visual identity and promotional campaign for the World BT Rio Brilhante ITF event — posters, social cards and print media designed to increase event visibility and ticket sales.",
        "pt": "Identidade visual e campanha promocional para o evento World BT Rio Brilhante ITF — cartazes, cards para redes sociais e mídia impressa para aumentar a visibilidade e venda de ingressos."
      },
      "skills": [
        "Advertising",
        "Product Design",
        "Graphic Design"
      ]
    },
    {
      "id": "3",
      "title": {
        "en": "EPK - Silver Panda 2023",
        "pt": "EPK - Silver Panda 2023"
      },
      "image": "https://mir-s3-cdn-cf.behance.net/projects/max_808/ac80b8175649747.Y3JvcCw3MTMsNTU4LDMxMiwxOTk.png",
      "url": "https://www.behance.net/gallery/175649747/EPK-SILVER-PANDA-2023",
      "category": "PRESS KIT",
      "type": "Graphic Design",
      "featured": false,
      "description": {
        "en": "Electronic press kit (EPK) and promotional package for Silver Panda — includes release artwork, EPK PDF and social visuals for the 2023 campaign.",
        "pt": "Electronic press kit (EPK) and promotional package for Silver Panda — includes release artwork, EPK PDF and social visuals for the 2023 campaign."
      },
      "skills": [
        "Graphic Design",
        "Poster Design"
      ]
    },
    {
      "id": "4",
      "title": {
        "en": "WELKER - Website",
        "pt": "WELKER - Website"
      },
      "image": "https://mir-s3-cdn-cf.behance.net/projects/max_808/46c5e2220863273.Y3JvcCwyMzgwLDE4NjIsMTQ3Myww.png",
      "url": "https://www.behance.net/gallery/220863273/WELKER-Website",
      "category": "WEB DEVELOPMENT",
      "type": "Design & Development",
      "featured": false,
      "description": {
        "en": "Responsive website for artist Welker — landing pages for press, tour dates and streaming links, optimized for mobile and SEO.",
        "pt": "Responsive website for artist Welker — landing pages for press, tour dates and streaming links, optimized for mobile and SEO."
      },
      "skills": [
        "Web Design",
        "Photography",
        "Next.js"
      ]
    },
    {
      "id": "5",
      "title": {
        "en": "Universe - Berg (2023)",
        "pt": "Universe - Berg (2023)"
      },
      "image": "https://mir-s3-cdn-cf.behance.net/projects/max_808/6220fd175722695.Y3JvcCwxMTIzLDg3OCwxNTIsNDAz.png",
      "url": "https://www.behance.net/gallery/175722695/SINGLE-COVER-UNIVERSE-BERG-2023",
      "category": "COVER ART",
      "type": "Music Artwork",
      "featured": false,
      "description": {
        "en": "Single cover art design for 'Universe' by Berg (2023). Artwork created for streaming platforms and social promotion. Metrics: 1.202.000 Spotify streams.",
        "pt": "Single cover art design for 'Universe' by Berg (2023). Artwork created for streaming platforms and social promotion. Metrics: 1.202.000 Spotify streams."
      },
      "skills": [
        "Graphic Design",
        "Illustration",
        "Advertising"
      ]
    },
    {
      "id": "6",
      "title": { "en": "Motin Films - Filmes de alto impacto", "pt": "Motin Films - Filmes de alto impacto" },
      "image": "/screenshots/01_motin_site.png",
      "url": "https://motinfilms.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Film Production / Audiovisual",
      "featured": false,
      "description": {
        "en": "Audiovisual production company specialized in creating high-impact films with cinematographic quality, connecting brands and people through memorable stories.",
        "pt": "Produtora audiovisual especializada em criar filmes de alto impacto com qualidade cinematográfica, conectando marcas e pessoas através de histórias memoráveis."
      },
      "skills": ["Next.js", "Tailwind Cross-platform"]
    },
    {
      "id": "7",
      "title": { "en": "Metal Carbon Hub", "pt": "Metal Carbon Hub" },
      "image": "/screenshots/02_metalcarbon.png",
      "url": "https://metalcarbonhub.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Recycling / Sustainability",
      "featured": false,
      "description": {
        "en": "Company specialized in recycling and processing ferrous scrap, combining innovation, technology and environmental responsibility to build a circular and sustainable future.",
        "pt": "Empresa especializada em reciclagem e processamento de sucata ferrosa, unindo inovação, tecnologia e responsabilidade ambiental para construir um futuro circular e sustentável."
      },
      "skills": ["Next.js", "React"]
    },
    {
      "id": "8",
      "title": { "en": "Autosocorro Nobre", "pt": "Autosocorro Nobre" },
      "image": "/screenshots/03_autosocorro.png",
      "url": "https://autosocorronobre.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Automotive Services / Towing",
      "featured": false,
      "description": {
        "en": "24-hour towing service in Ortigueira, offering fast and reliable assistance. Your call is the company's priority, available 24/7.",
        "pt": "Serviço de guincho 24 horas em Ortigueira, oferecendo atendimento ágil e de confiança. Seu chamado é a prioridade da empresa, disponível 24/7."
      },
      "skills": ["Next.js", "React"]
    },
    {
      "id": "9",
      "title": { "en": "Skin Care Esthetic Beauty", "pt": "Skin Care Esthetic Beauty" },
      "image": "/screenshots/04_skincare_site_kgvu.png",
      "url": "https://skincareestheticbeauty.com",
      "category": "WEB DEVELOPMENT",
      "type": "Beauty / Aesthetics",
      "featured": false,
      "description": {
        "en": "Esthetics clinic located in Japan with over 10 years of experience, offering exclusive aesthetic procedures to enhance natural beauty and restore self-esteem.",
        "pt": "Clínica de estética localizada no Japão com mais de 10 anos de experiência, oferecendo procedimentos estéticos exclusivos para realçar a beleza natural e restaurar a autoestima."
      },
      "skills": ["Next.js", "E-commerce"]
    },
    {
      "id": "10",
      "title": { "en": "Porto Itapoá - Gateway da América Latina", "pt": "Porto Itapoá - Gateway da América Latina" },
      "image": "/screenshots/05_portoitapoa.png",
      "url": "https://portoitapoa.catalisti.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Ports / Logistics",
      "featured": false,
      "description": {
        "en": "Modern port terminal connecting Brazil to the world with efficiency, technology and sustainability. One of the most modern terminals in South America.",
        "pt": "Terminal portuário moderno que conecta o Brasil ao mundo com eficiência, tecnologia e sustentabilidade. Um dos terminais mais modernos da América do Sul."
      },
      "skills": ["Next.js", "Logistics", "Three.js"]
    },
    {
      "id": "11",
      "title": { "en": "Provedor Conect - Internet Fibra Óptica", "pt": "Provedor Conect - Internet Fibra Óptica" },
      "image": "/screenshots/06_provedor_conect.png",
      "url": "https://provedorconect.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Telecommunications / ISP",
      "featured": false,
      "description": {
        "en": "Fiber optic internet and landline phone provider located in Simplício Mendes. Offers plans for homes and businesses, connecting customers to the world with quality.",
        "pt": "Provedor de internet fibra óptica e telefonia fixa localizado em Simplício Mendes. Oferece planos para residências e empresas, conectando clientes ao mundo com qualidade."
      },
      "skills": ["Next.js", "ISP"]
    },
    {
      "id": "12",
      "title": { "en": "Protege - Liderança e inovação em proteção contra incêndios", "pt": "Protege - Liderança e inovação em proteção contra incêndios" },
      "image": "/screenshots/07_protege.png",
      "url": "https://protege.ind.br",
      "category": "WEB DEVELOPMENT",
      "type": "Fire Safety / Industrial",
      "featured": false,
      "description": {
        "en": "Leading company in fire extinguisher manufacturing with the highest quality standards, ensuring protection and safety for property and lives.",
        "pt": "Empresa referência na fabricação de extintores de incêndio com o mais alto padrão de qualidade, garantindo proteção e segurança para patrimônio e vidas."
      },
      "skills": ["Next.js", "Industrial"]
    },
    {
      "id": "13",
      "title": { "en": "DI.RAY", "pt": "DI.RAY" },
      "image": "/screenshots/08_diray_site.png",
      "url": "https://diray.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "HR / People Management",
      "featured": false,
      "description": {
        "en": "People management platform offering the '4 coffees' methodology to help teams deliver sustainable results and make teams work better.",
        "pt": "Plataforma de gestão de pessoas que oferece metodologia '4 cafés' para ajudar equipes a entregar resultados sustentáveis e fazer times funcionarem melhor."
      },
      "skills": ["Next.js", "HR Tech"]
    },
    {
      "id": "14",
      "title": { "en": "Aquila Fund FCR - Investimentos de Valor em Portugal", "pt": "Aquila Fund FCR - Investimentos de Valor em Portugal" },
      "image": "/screenshots/09_aquilafcrsite.png",
      "url": "https://aquilafcr.com",
      "category": "WEB DEVELOPMENT",
      "type": "Investment / Finance",
      "featured": false,
      "description": {
        "en": "Portuguese investment fund focused on the Golden Visa program, offering tailor-made solutions to protect investors' financial future in Portugal.",
        "pt": "Fundo de investimento português focado no programa Golden Visa, oferecendo soluções tailor-made para proteger o futuro financeiro dos investidores em Portugal."
      },
      "skills": ["Next.js", "Finance"]
    },
    {
      "id": "15",
      "title": { "en": "24H Turismo Corporate - Gestão de Viagens Corporativas", "pt": "24H Turismo Corporate - Gestão de Viagens Corporativas" },
      "image": "/screenshots/10_24h3.png",
      "url": "https://24h.tur.br",
      "category": "WEB DEVELOPMENT",
      "type": "Travel / Corporate Tourism",
      "featured": false,
      "description": {
        "en": "Corporate travel management platform combining self-booking technology with personalized 24/7 human support, offering total control over business trips.",
        "pt": "Plataforma de gestão de viagens corporativas que combina tecnologia de self-booking com suporte humano personalizado 24/7, oferecendo controle total sobre viagens de negócios."
      },
      "skills": ["Next.js", "Tourism Tech"]
    },
    {
      "id": "16",
      "title": { "en": "Catalisti Holding - Ecossistema Martech", "pt": "Catalisti Holding - Ecossistema Martech" },
      "image": "/screenshots/11_catalisti_site.png",
      "url": "https://catalisti.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Marketing Technology",
      "featured": false,
      "description": {
        "en": "Martech ecosystem holding company offering marketing and technology services, with certifications and client testimonials.",
        "pt": "Holding de ecossistema Martech oferecendo serviços de marketing e tecnologia, com certificações e depoimentos de clientes."
      },
      "skills": ["Next.js", "Martech"]
    },
    {
      "id": "17",
      "title": { "en": "Instituto Avance - Cursos de Ultrassom com Dr. Joney", "pt": "Instituto Avance - Cursos de Ultrassom com Dr. Joney" },
      "image": "/screenshots/12_v0_instituto_avance_project.png",
      "url": "https://avanceemsaude.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Healthcare Education",
      "featured": false,
      "description": {
        "en": "Healthcare training center dedicated to professionals, offering ultrasound courses, training, mentoring and updated content.",
        "pt": "Centro de formação em saúde dedicado a profissionais da área, oferecendo cursos de ultrassonografia, treinamentos, mentorias e conteúdos atualizados."
      },
      "skills": ["Next.js", "EdTech"]
    },
    {
      "id": "18",
      "title": { "en": "LJ Santos - Sustainable Industrial Solutions", "pt": "LJ Santos - Sustainable Industrial Solutions" },
      "image": "/screenshots/13_site_ljsantos.png",
      "url": "https://ljsantos.com",
      "category": "WEB DEVELOPMENT",
      "type": "Industrial / Manufacturing",
      "featured": false,
      "description": {
        "en": "Sustainable industrial solutions company with proven quality and reliability, manufacturing products like carbon filters for industrial applications.",
        "pt": "Empresa de soluções industriais sustentáveis com qualidade e confiabilidade comprovadas, fabricando produtos como filtros de carvão para aplicações industriais."
      },
      "skills": ["Next.js", "Manufacturing"]
    },
    {
      "id": "19",
      "title": { "en": "ServiçosJá - Marketplace de Serviços", "pt": "ServiçosJá - Marketplace de Serviços" },
      "image": "/screenshots/14_v0_marketplace_platform.png",
      "url": "https://pedrobarros.catalisti.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Marketplace / Services",
      "featured": false,
      "description": {
        "en": "Services marketplace connecting customers to the best qualified service providers in their region, with over 50,000 registered providers.",
        "pt": "Marketplace de serviços que conecta clientes aos melhores prestadores de serviços qualificados da região, com mais de 50.000 prestadores cadastrados."
      },
      "skills": ["Next.js", "Marketplace"]
    },
    {
      "id": "21",
      "title": { "en": "MacBar Spa by Helen", "pt": "MacBar Spa by Helen" },
      "image": "/screenshots/16_macbar_spa.png",
      "url": "https://macbarspa.com",
      "category": "WEB DEVELOPMENT",
      "type": "Spa / Wellness",
      "featured": false,
      "description": {
        "en": "Premium spa offering luxury treatments and specialized lymphatic drainage services tailored to each client's unique needs.",
        "pt": "Spa premium oferecendo tratamentos de luxo e serviços especializados de drenagem linfática personalizados para cada cliente."
      },
      "skills": ["Next.js", "Wellness"]
    },
    {
      "id": "22",
      "title": { "en": "VTelco - Simplifique sua rede", "pt": "VTelco - Simplifique sua rede" },
      "image": "/screenshots/01_motin_site.png",
      "url": "https://vtelco.com.br/olt-control",
      "category": "WEB DEVELOPMENT",
      "type": "Telecommunications / Software",
      "featured": false,
      "description": {
        "en": "Fiber optic network management solution with real-time monitoring, predictive analytics and intelligent automation. Over 300 providers served.",
        "pt": "Solução para gestão de redes de fibra óptica com monitoramento em tempo real, análise preditiva e automação inteligente. Mais de 300 provedores atendidos."
      },
      "skills": ["Next.js", "SaaS"]
    },
    {
      "id": "24",
      "title": { "en": "Infiniti Grass - Grama Sintética Esportiva dos Campeões", "pt": "Infiniti Grass - Grama Sintética Esportiva dos Campeões" },
      "image": "/screenshots/19_infiniti_grass_lp.png",
      "url": "https://infinitigrass.m2z.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Sports / Turf Manufacturing",
      "featured": false,
      "description": {
        "en": "Sports synthetic grass company with FIFA Quality standard, over 10 years warranty. Ideal for soccer fields and high-performance projects.",
        "pt": "Empresa de grama sintética esportiva com padrão FIFA Quality, mais de 10 anos de garantia. Ideal para campos de futebol e projetos de alto rendimento."
      },
      "skills": ["Next.js", "Sports"]
    },
    {
      "id": "25",
      "title": { "en": "Aurion Partners | Estratégia em Movimento", "pt": "Aurion Partners | Estratégia em Movimento" },
      "image": "/screenshots/20_aurion.png",
      "url": "https://aurion.m2z.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Consulting / Strategy",
      "featured": false,
      "description": {
        "en": "Strategic consulting specialized in accelerating results and unlocking maximum business potential. Over 40 years of experience, 200+ projects in 15+ countries.",
        "pt": "Consultoria estratégica especializada em acelerar resultados e desbloquear o potencial máximo de negócios. Mais de 40 anos de experiência, 200+ projetos em 15+ países."
      },
      "skills": ["Next.js", "Consulting"]
    },
    {
      "id": "27",
      "title": { "en": "Althion", "pt": "Althion" },
      "image": "/screenshots/22_althion.png",
      "url": "https://althion.m2z.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Pharmaceutical / Industrial Automation",
      "featured": false,
      "description": {
        "en": "Specialists in pharmaceutical industry, offering automation, instrumentation and control solutions for life sciences.",
        "pt": "Especialistas em indústria farmacêutica, oferecendo soluções em automação, instrumentação e controle para ciências da vida."
      },
      "skills": ["Next.js", "Pharma"]
    },
    {
      "id": "28",
      "title": { "en": "NEOOMMA Engenharia - Ambientes corporativos", "pt": "NEOOMMA Engenharia - Ambientes corporativos" },
      "image": "/screenshots/23_omma-lps.png",
      "url": "https://lp.omma.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Engineering / Construction",
      "featured": false,
      "description": {
        "en": "Corporate engineering with innovation and excellence in corporate construction, transforming company vision into functional and high-performance environments.",
        "pt": "Engenharia corporativa com inovação e excelência em obras corporativas, transformando a visão de empresas em ambientes funcionais e de alta performance."
      },
      "skills": ["Next.js", "Engineering"]
    },
    {
      "id": "30",
      "title": { "en": "CVC Assaí Tatuapé - Eurotrip", "pt": "CVC Assaí Tatuapé - Eurotrip" },
      "image": "/screenshots/25_cvc-assai-tatuape.png",
      "url": "https://cvc.m2z.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Travel / Tourism",
      "featured": false,
      "description": {
        "en": "CVC Assaí Tatuapé landing page specialized in personalized Europe itineraries, offering exclusive service and travel consulting.",
        "pt": "Landing page da CVC Assaí Tatuapé especializada em roteiros personalizados para a Europa, oferecendo atendimento exclusivo e consultoria de viagem."
      },
      "skills": ["Next.js", "Tourism"]
    },
    {
      "id": "31",
      "title": { "en": "OMMA Engenharia", "pt": "OMMA Engenharia" },
      "image": "/screenshots/26_omma2.png",
      "url": "https://www.omma.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Engineering / Construction",
      "featured": false,
      "description": {
        "en": "Building high-performance spaces for business success. Engineering solutions with complete project management.",
        "pt": "Construindo espaços de alta performance para o sucesso empresarial. Soluções de engenharia com gestão completa de projetos."
      },
      "skills": ["Next.js", "Construction"]
    },
    {
      "id": "32",
      "title": { "en": "Bang Toys - Veículos Elétricos Infantis | Distribuidora Líder no Brasil", "pt": "Bang Toys - Veículos Elétricos Infantis | Distribuidora Líder no Brasil" },
      "image": "/screenshots/27_bangtoys.png",
      "url": "https://bangtoys.m2z.com.br",
      "category": "WEB DEVELOPMENT",
      "type": "Toys / E-commerce",
      "featured": false,
      "description": {
        "en": "Leading distributor in Brazil for children's electric vehicles, with over 150 strategic products including cars, motorcycles, scooters and ATVs.",
        "pt": "Distribuidora líder no Brasil em veículos elétricos infantis, com mais de 150 produtos estratégicos incluindo carros, motos, scooters e quadriciclos."
      },
      "skills": ["Next.js", "E-commerce"]
    },
    {
      "id": "34",
      "title": { "en": "Silver Panda", "pt": "Silver Panda" },
      "image": "/screenshots/29_silverpanda.png",
      "gifImage": "/screenshots/silverpanda_scroll.gif",
      "url": "https://silverpanda.moitinho.dev",
      "category": "WEB DEVELOPMENT",
      "type": "Music / Digital Presskit",
      "featured": true,
      "highlight": {
        "en": "Digital presskit for DJ duo Silver Panda — 3M+ monthly Spotify listeners",
        "pt": "Presskit digital para a dupla Silver Panda — 3M+ ouvintes mensais no Spotify"
      },
      "description": {
        "en": "Presskit digital for the Brazilian and Israeli DJ duo, Leonardo and Shalomi Berg: Silver Panda. 3 million monthly listeners on Spotify.",
        "pt": "Presskit digital para a dupla de DJ's Brasileiro e Israelense, Leonardo e Shalomi Berg: Silver Panda. 3 Milhões de ouvintes mensais no Spotify."
      },
      "skills": ["Next.js", "Strapi CMS", "Spotify API", "Music"]
    }
  ],
  "articles": [
    {
      "id": "1",
      "title": {
        "en": "Test",
        "pt": "Teste"
      },
      "slug": {
        "en": "test",
        "pt": "teste"
      },
      "excerpt": {
        "en": "yay",
        "pt": "uhul"
      },
      "content": {
        "en": "<p>testtttt</p>",
        "pt": "<p>testeeeee</p>"
      },
      "coverImage": "",
      "category": "Dev",
      "tags": [
        "react"
      ],
      "publishedAt": "2025-10-15T05:21:49.505Z",
      "updatedAt": "2025-10-15T06:25:08.205Z",
      "published": true,
      "readTime": 1
    }
  ]
}